#include "../main.h"
#include "../GameWorld.h"
#include "../Map/map.h"

#include "STitle.h"

map m;
STitle::STitle() 
{
	m.LoadMap();
	m_id = TITLE;
}

STitle::~STitle()
{
	
}

//===================================
// タイトル画面の更新
//===================================
int STitle::Update()
{
	// Esc キーでゲーム終了
	if (GetAsyncKeyState(VK_ESCAPE)) {
		APP.m_CloseFlag = true;
	}

	return TITLE;
}

//===================================
// タイトル画面の描画
//===================================
void STitle::Draw()
{
	// 描画開始
	cdg.GetDev()->BeginScene();

	// バックバッファと Z バッファをクリア
	cdg.Clear(true, true, false, XRGB(100, 100, 100), 1.0f, 0);


	//-------------------------------------------
	// カメラ処理
	//-------------------------------------------


	//-------------------------------------------
	// 描画処理
	//-------------------------------------------
	Render();
	m.DrawMap();
	//-------------------------------------------
	// スプライト	2D画像
	//-------------------------------------------


	//--------------------------------------------
	// 文字表示
	//--------------------------------------------


	// 描画終了
	cdg.GetDev()->EndScene();

	// バックバッファをプライマリバッファにコピー
	cdg.GetDev()->Present(NULL, NULL, NULL, NULL);

}


//================================================================
// 描画処理
//================================================================
void STitle::Render()
{

}
