#include "../main.h"
#include "../GameWorld.h"

#include "STitle.h"


STitle::STitle() 
{
	m_id = TITLE;

	cdg.SetDirectionalLight(0,
		&D3DXVECTOR3(1, -1, 0),				// ライトの方向
		&D3DXCOLOR(1.0f, 1.0f, 1.0f, 1.0f),	// 基本色(ディフーズ RGBA)
		&D3DXCOLOR(0.3f, 0.3f, 0.3f, 0.0f),	// 環境色(アンビエント RGBA)
		&D3DXCOLOR(1.0f, 1.0f, 1.0f, 0.0f)	// 反射色(スペキュラ RGBA)
	);

}

STitle::~STitle()
{
	
}

//===================================
// タイトル画面の更新
//===================================
int STitle::Update()
{
	// Esc キーでゲーム終了
	if (GetAsyncKeyState(VK_ESCAPE)) {
		APP.m_CloseFlag = true;
	}

	return TITLE;
}

//===================================
// タイトル画面の描画
//===================================
void STitle::Draw()
{
	// 描画開始
	cdg.GetDev()->BeginScene();

	// バックバッファと Z バッファをクリア
	cdg.Clear(true, true, false, XRGB(100, 100, 100), 1.0f, 0);


	//-------------------------------------------
	// カメラ処理
	//-------------------------------------------


	//-------------------------------------------
	// 描画処理
	//-------------------------------------------
	Render();

	//-------------------------------------------
	// スプライト	2D画像
	//-------------------------------------------


	//--------------------------------------------
	// 文字表示
	//--------------------------------------------


	// 描画終了
	cdg.GetDev()->EndScene();

	// バックバッファをプライマリバッファにコピー
	cdg.GetDev()->Present(nullptr, nullptr, nullptr, nullptr);

}


//================================================================
// 描画処理
//================================================================
void STitle::Render()
{

}
